<!-- dflook/terraform-github-actions {"workspace":"dev","backend_type":"s3","label":"dev","backend":"9254c9c8319b39806e8841134f2d0699680fe0c4875487ce8b6740b2cf57d1f7","plan_job_ref":"Job CICD for Splitrr Infra #3 at https://github.com/bibek65/Splitrr-Infrastructure/actions/runs/10654278662","plan_out_hash":"435c44fd88729722b659bef1ebf1a2c4597ad1538c6138e7017a64407f8a5473","plan_hash":"52859627a12496d4e2963d56b8c630390c3ff7f7687796b6411178c54f808270","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan for __dev__
<details>
<summary>Plan: 46 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_kms_alias.terraform_state will be created
+   resource "aws_kms_alias" "terraform_state" {
+       arn            = (known after apply)
+       id             = (known after apply)
+       name           = "alias/splitrr-dev-terraform-state"
+       name_prefix    = (known after apply)
+       target_key_arn = (known after apply)
+       target_key_id  = (known after apply)
    }

  # aws_kms_key.terraform_state will be created
+   resource "aws_kms_key" "terraform_state" {
+       arn                                = (known after apply)
+       bypass_policy_lockout_safety_check = false
+       customer_master_key_spec           = "*****************"
+       description                        = "This key is used to encrypt bucket objects"
+       enable_key_rotation                = false
+       id                                 = (known after apply)
+       is_enabled                         = true
+       key_id                             = (known after apply)
+       key_usage                          = "ENCRYPT_DECRYPT"
+       multi_region                       = (known after apply)
+       policy                             = (known after apply)
+       rotation_period_in_days            = (known after apply)
+       tags_all                           = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Project" = "Splitrr"
        }
    }

  # aws_s3_bucket.terraform_state will be created
+   resource "aws_s3_bucket" "terraform_state" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "splitrr-dev-terraform-state"
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags_all                    = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Project" = "Splitrr"
        }
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       cors_rule (known after apply)

+       grant (known after apply)

+       lifecycle_rule (known after apply)

+       logging (known after apply)

+       object_lock_configuration (known after apply)

+       replication_configuration (known after apply)

+       server_side_encryption_configuration (known after apply)

+       versioning (known after apply)

+       website (known after apply)
    }

  # aws_s3_bucket_public_access_block.terraform_state will be created
+   resource "aws_s3_bucket_public_access_block" "terraform_state" {
+       block_public_acls       = true
+       block_public_policy     = true
+       bucket                  = (known after apply)
+       id                      = (known after apply)
+       ignore_public_acls      = true
+       restrict_public_buckets = true
    }

  # aws_s3_bucket_server_side_encryption_configuration.terraform_state will be created
+   resource "aws_s3_bucket_server_side_encryption_configuration" "terraform_state" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       rule {
+           bucket_key_enabled = true

+           apply_server_side_encryption_by_default {
+               kms_master_key_id = (known after apply)
+               sse_algorithm     = "aws:kms"
            }
        }
    }

  # aws_s3_bucket_versioning.terraform_state will be created
+   resource "aws_s3_bucket_versioning" "terraform_state" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       versioning_configuration {
+           mfa_delete = (known after apply)
+           status     = "Enabled"
        }
    }

  # module.alb.aws_alb.golend_alb will be created
+   resource "aws_alb" "golend_alb" {
+       arn                                                          = (known after apply)
+       arn_suffix                                                   = (known after apply)
+       client_keep_alive                                            = 3600
+       desync_mitigation_mode                                       = "defensive"
+       dns_name                                                     = (known after apply)
+       drop_invalid_header_fields                                   = false
+       enable_deletion_protection                                   = false
+       enable_http2                                                 = true
+       enable_tls_version_and_cipher_suite_headers                  = false
+       enable_waf_fail_open                                         = false
+       enable_xff_client_port                                       = false
+       enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
+       id                                                           = (known after apply)
+       idle_timeout                                                 = 60
+       internal                                                     = false
+       ip_address_type                                              = (known after apply)
+       load_balancer_type                                           = "application"
+       name                                                         = "splitrr-dev-alb"
+       name_prefix                                                  = (known after apply)
+       preserve_host_header                                         = false
+       security_groups                                              = (known after apply)
+       subnets                                                      = (known after apply)
+       tags                                                         = {
+           "Name" = "splitrr-dev-alb"
        }
+       tags_all                                                     = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "splitrr-dev-alb"
+           "Project" = "Splitrr"
        }
+       vpc_id                                                       = (known after apply)
+       xff_header_processing_mode                                   = "append"
+       zone_id                                                      = (known after apply)

+       subnet_mapping (known after apply)
    }

  # module.alb.aws_alb_listener.backend_end will be created
+   resource "aws_alb_listener" "backend_end" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       load_balancer_arn = (known after apply)
+       port              = 80
+       protocol          = "HTTP"
+       ssl_policy        = (known after apply)
+       tags              = {
+           "Name" = "splitrr-dev-alb-listener"
        }
+       tags_all          = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "splitrr-dev-alb-listener"
+           "Project" = "Splitrr"
        }

+       default_action {
+           order = (known after apply)
+           type  = "redirect"

+           redirect {
+               host        = "#{host}"
+               path        = "/#{path}"
+               port        = "443"
+               protocol    = "HTTPS"
+               query       = "#{query}"
+               status_code = "HTTP_301"
            }
        }

+       mutual_authentication (known after apply)
    }

  # module.alb.aws_alb_listener.https_listener will be created
+   resource "aws_alb_listener" "https_listener" {
+       arn               = (known after apply)
+       certificate_arn   = (known after apply)
+       id                = (known after apply)
+       load_balancer_arn = (known after apply)
+       port              = 443
+       protocol          = "HTTPS"
+       ssl_policy        = "ELBSecurityPolicy-TLS13-1-2-2021-06"
+       tags              = {
+           "Name" = "splitrr-dev-alb-https-listener"
        }
+       tags_all          = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "splitrr-dev-alb-https-listener"
+           "Project" = "Splitrr"
        }

+       default_action {
+           order = (known after apply)
+           type  = "fixed-response"

+           fixed_response {
+               content_type = "text/plain"
+               message_body = "Not Found"
+               status_code  = "404"
            }
        }

+       mutual_authentication (known after apply)
    }

  # module.alb.aws_security_group.lb will be created
+   resource "aws_security_group" "lb" {
+       arn                    = (known after apply)
+       description            = "controls access to the ALB"
+       egress                 = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "-1"
+               security_groups  = []
+               self             = false
+               to_port          = 0
#                (1 unchanged attribute hidden)
            },
        ]
+       id                     = (known after apply)
+       ingress                = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               from_port        = 443
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 443
#                (1 unchanged attribute hidden)
            },
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               from_port        = 80
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 80
#                (1 unchanged attribute hidden)
            },
        ]
+       name                   = "splitrr-dev-alb-lb-sg"
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Name" = "splitrr-dev-alb-lb-sg"
        }
+       tags_all               = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "splitrr-dev-alb-lb-sg"
+           "Project" = "Splitrr"
        }
+       vpc_id                 = (known after apply)
    }

  # module.alb_acm.data.aws_route53_zone.route53_zone will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_route53_zone" "route53_zone" {
+       arn                        = (known after apply)
+       caller_reference           = (known after apply)
+       comment                    = (known after apply)
+       id                         = (known after apply)
+       linked_service_description = (known after apply)
+       linked_service_principal   = (known after apply)
+       name                       = "dev.bibek65.tech"
+       name_servers               = (known after apply)
+       primary_name_server        = (known after apply)
+       private_zone               = false
+       resource_record_set_count  = (known after apply)
+       tags                       = (known after apply)
+       vpc_id                     = (known after apply)
+       zone_id                    = (known after apply)
    }

  # module.alb_acm.aws_acm_certificate.acm_certificate will be created
+   resource "aws_acm_certificate" "acm_certificate" {
+       arn                       = (known after apply)
+       domain_name               = "dev.bibek65.tech"
+       domain_validation_options = [
+           {
+               domain_name           = "api.dev.bibek65.tech"
+               resource_record_name  = (known after apply)
+               resource_record_type  = (known after apply)
+               resource_record_value = (known after apply)
            },
+           {
+               domain_name           = "app.dev.bibek65.tech"
+               resource_record_name  = (known after apply)
+               resource_record_type  = (known after apply)
+               resource_record_value = (known after apply)
            },
+           {
+               domain_name           = "dev.bibek65.tech"
+               resource_record_name  = (known after apply)
+               resource_record_type  = (known after apply)
+               resource_record_value = (known after apply)
            },
        ]
+       id                        = (known after apply)
+       key_algorithm             = (known after apply)
+       not_after                 = (known after apply)
+       not_before                = (known after apply)
+       pending_renewal           = (known after apply)
+       renewal_eligibility       = (known after apply)
+       renewal_summary           = (known after apply)
+       status                    = (known after apply)
+       subject_alternative_names = [
+           "api.dev.bibek65.tech",
+           "app.dev.bibek65.tech",
+           "dev.bibek65.tech",
        ]
+       tags                      = {
+           "Name" = "splitrr-dev-alb-acm"
        }
+       tags_all                  = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "splitrr-dev-alb-acm"
+           "Project" = "Splitrr"
        }
+       type                      = (known after apply)
+       validation_emails         = (known after apply)
+       validation_method         = "DNS"

+       options (known after apply)
    }

  # module.alb_acm.aws_acm_certificate_validation.acm_certificate_validation will be created
+   resource "aws_acm_certificate_validation" "acm_certificate_validation" {
+       certificate_arn         = (known after apply)
+       id                      = (known after apply)
+       validation_record_fqdns = (known after apply)
    }

  # module.alb_acm.aws_route53_record.route53_record["api.dev.bibek65.tech"] will be created
+   resource "aws_route53_record" "route53_record" {
+       allow_overwrite = true
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = (known after apply)
+       records         = (known after apply)
+       ttl             = 60
+       type            = (known after apply)
+       zone_id         = (known after apply)
    }

  # module.alb_acm.aws_route53_record.route53_record["app.dev.bibek65.tech"] will be created
+   resource "aws_route53_record" "route53_record" {
+       allow_overwrite = true
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = (known after apply)
+       records         = (known after apply)
+       ttl             = 60
+       type            = (known after apply)
+       zone_id         = (known after apply)
    }

  # module.alb_acm.aws_route53_record.route53_record["dev.bibek65.tech"] will be created
+   resource "aws_route53_record" "route53_record" {
+       allow_overwrite = true
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = (known after apply)
+       records         = (known after apply)
+       ttl             = 60
+       type            = (known after apply)
+       zone_id         = (known after apply)
    }

  # module.app_route53_record.aws_route53_record.site_domain will be created
+   resource "aws_route53_record" "site_domain" {
+       allow_overwrite = (known after apply)
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = "app"
+       type            = "A"
+       zone_id         = (known after apply)

+       alias {
+           evaluate_target_health = true
+           name                   = (known after apply)
+           zone_id                = (known after apply)
        }
    }

  # module.backend_route53_record.aws_route53_record.site_domain will be created
+   resource "aws_route53_record" "site_domain" {
+       allow_overwrite = (known after apply)
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = "api"
+       type            = "A"
+       zone_id         = (known after apply)

+       alias {
+           evaluate_target_health = true
+           name                   = (known after apply)
+           zone_id                = (known after apply)
        }
    }

  # module.route53.aws_route53_zone.hosted_zone will be created
+   resource "aws_route53_zone" "hosted_zone" {
+       arn                 = (known after apply)
+       comment             = "Managed by Terraform"
+       force_destroy       = false
+       id                  = (known after apply)
+       name                = "dev.bibek65.tech"
+       name_servers        = (known after apply)
+       primary_name_server = (known after apply)
+       tags_all            = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Project" = "Splitrr"
        }
+       zone_id             = (known after apply)
    }

  # module.secrets.aws_secretsmanager_secret.secret will be created
+   resource "aws_secretsmanager_secret" "secret" {
+       arn                            = (known after apply)
+       description                    = "Secret for environment variables"
+       force_overwrite_replica_secret = false
+       id                             = (known after apply)
+       name                           = "splitrr-dev-secret-manager"
+       name_prefix                    = (known after apply)
+       policy                         = (known after apply)
+       recovery_window_in_days        = 30
+       tags                           = {
+           "Name" = "splitrr-dev-secret-manager"
        }
+       tags_all                       = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "splitrr-dev-secret-manager"
+           "Project" = "Splitrr"
        }
#        (1 unchanged attribute hidden)

+       replica (known after apply)
    }

  # module.secrets.aws_secretsmanager_secret_version.secret_version will be created
+   resource "aws_secretsmanager_secret_version" "secret_version" {
+       arn            = (known after apply)
+       id             = (known after apply)
+       secret_id      = (known after apply)
+       secret_string  = (sensitive value)
+       version_id     = (known after apply)
+       version_stages = (known after apply)
    }

  # module.vpc.aws_cloudwatch_log_group.vpc_flow_log_group[0] will be created
+   resource "aws_cloudwatch_log_group" "vpc_flow_log_group" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       kms_key_id        = (known after apply)
+       log_group_class   = (known after apply)
+       name              = "splitrr-dev-vpc-flow-log-group"
+       name_prefix       = (known after apply)
+       retention_in_days = 0
+       skip_destroy      = false
+       tags_all          = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Project" = "Splitrr"
        }
    }

  # module.vpc.aws_eip.nat_eip[0] will be created
+   resource "aws_eip" "nat_eip" {
+       allocation_id        = (known after apply)
+       arn                  = (known after apply)
+       association_id       = (known after apply)
+       carrier_ip           = (known after apply)
+       customer_owned_ip    = (known after apply)
+       domain               = "vpc"
+       id                   = (known after apply)
+       instance             = (known after apply)
+       network_border_group = (known after apply)
+       network_interface    = (known after apply)
+       private_dns          = (known after apply)
+       private_ip           = (known after apply)
+       ptr_record           = (known after apply)
+       public_dns           = (known after apply)
+       public_ip            = (known after apply)
+       public_ipv4_pool     = (known after apply)
+       tags                 = {
+           "Name" = "splitrr-dev-vpc-nat-eip"
        }
+       tags_all             = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "splitrr-dev-vpc-nat-eip"
+           "Project" = "Splitrr"
        }
+       vpc                  = (known after apply)
    }

  # module.vpc.aws_eip.nat_eip[1] will be created
+   resource "aws_eip" "nat_eip" {
+       allocation_id        = (known after apply)
+       arn                  = (known after apply)
+       association_id       = (known after apply)
+       carrier_ip           = (known after apply)
+       customer_owned_ip    = (known after apply)
+       domain               = "vpc"
+       id                   = (known after apply)
+       instance             = (known after apply)
+       network_border_group = (known after apply)
+       network_interface    = (known after apply)
+       private_dns          = (known after apply)
+       private_ip           = (known after apply)
+       ptr_record           = (known after apply)
+       public_dns           = (known after apply)
+       public_ip            = (known after apply)
+       public_ipv4_pool     = (known after apply)
+       tags                 = {
+           "Name" = "splitrr-dev-vpc-nat-eip"
        }
+       tags_all             = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "splitrr-dev-vpc-nat-eip"
+           "Project" = "Splitrr"
        }
+       vpc                  = (known after apply)
    }

  # module.vpc.aws_flow_log.vpc_flow_log[0] will be created
+   resource "aws_flow_log" "vpc_flow_log" {
+       arn                      = (known after apply)
+       iam_role_arn             = (known after apply)
+       id                       = (known after apply)
+       log_destination          = (known after apply)
+       log_destination_type     = "cloud-watch-logs"
+       log_format               = (known after apply)
+       log_group_name           = (known after apply)
+       max_aggregation_interval = 600
+       tags_all                 = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Project" = "Splitrr"
        }
+       traffic_type             = "ALL"
+       vpc_id                   = (known after apply)
    }

  # module.vpc.aws_iam_role.vpc_flow_role[0] will be created
+   resource "aws_iam_role" "vpc_flow_role" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "vpc-flow-logs.amazonaws.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "splitrr-dev-vpc-flow-role"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Project" = "Splitrr"
        }
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # module.vpc.aws_iam_role_policy.vpc_flow_role_policy[0] will be created
+   resource "aws_iam_role_policy" "vpc_flow_role_policy" {
+       id          = (known after apply)
+       name        = "splitrr-dev-vpc-flow-role-policy"
+       name_prefix = (known after apply)
+       policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "logs:PutLogEvents",
+                           "logs:DescribeLogStreams",
+                           "logs:DescribeLogGroups",
+                           "logs:CreateLogStream",
+                           "logs:CreateLogGroup",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       role        = (known after apply)
    }

  # module.vpc.aws_internet_gateway.igw will be created
+   resource "aws_internet_gateway" "igw" {
+       arn      = (known after apply)
+       id       = (known after apply)
+       owner_id = (known after apply)
+       tags     = {
+           "Name" = "splitrr-dev-vpc-igw"
        }
+       tags_all = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "splitrr-dev-vpc-igw"
+           "Project" = "Splitrr"
        }
+       vpc_id   = (known after apply)
    }

  # module.vpc.aws_kms_alias.cloudwatch_log_key_alias[0] will be created
+   resource "aws_kms_alias" "cloudwatch_log_key_alias" {
+       arn            = (known after apply)
+       id             = (known after apply)
+       name           = "alias/splitrr-dev-vpc-cloudwatch-log-key"
+       name_prefix    = (known after apply)
+       target_key_arn = (known after apply)
+       target_key_id  = (known after apply)
    }

  # module.vpc.aws_kms_key.cloudwatch_log_key[0] will be created
+   resource "aws_kms_key" "cloudwatch_log_key" {
+       arn                                = (known after apply)
+       bypass_policy_lockout_safety_check = false
+       customer_master_key_spec           = "*****************"
+       description                        = "KMS key for encrypting CloudWatch Logs"
+       enable_key_rotation                = false
+       id                                 = (known after apply)
+       is_enabled                         = true
+       key_id                             = (known after apply)
+       key_usage                          = "ENCRYPT_DECRYPT"
+       multi_region                       = (known after apply)
+       policy                             = jsonencode(
            {
+               Id        = "key-default-1"
+               Statement = [
+                   {
+                       Action    = "kms:*"
+                       Effect    = "Allow"
+                       Principal = {
+                           AWS = "arn:aws:iam::949263681218:root"
                        }
+                       Resource  = "*"
+                       Sid       = "Enable IAM User Permissions"
                    },
+                   {
+                       Action    = [
+                           "kms:Encrypt",
+                           "kms:Decrypt",
+                           "kms:ReEncrypt*",
+                           "kms:GenerateDataKey*",
+                           "kms:DescribeKey",
                        ]
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "logs.ap-southeast-2.amazonaws.com"
                        }
+                       Resource  = "*"
+                       Sid       = "Allow CloudWatch Logs use of the key"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       rotation_period_in_days            = (known after apply)
+       tags                               = {
+           "Name" = "splitrr-dev-vpc-cloudwatch-log-key"
        }
+       tags_all                           = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "splitrr-dev-vpc-cloudwatch-log-key"
+           "Project" = "Splitrr"
        }
    }

  # module.vpc.aws_nat_gateway.nat_gateway[0] will be created
+   resource "aws_nat_gateway" "nat_gateway" {
+       allocation_id                      = (known after apply)
+       association_id                     = (known after apply)
+       connectivity_type                  = "public"
+       id                                 = (known after apply)
+       network_interface_id               = (known after apply)
+       private_ip                         = (known after apply)
+       public_ip                          = (known after apply)
+       secondary_private_ip_address_count = (known after apply)
+       secondary_private_ip_addresses     = (known after apply)
+       subnet_id                          = (known after apply)
+       tags                               = {
+           "Name" = "splitrr-dev-vpc-nat-gateway"
        }
+       tags_all                           = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "splitrr-dev-vpc-nat-gateway"
+           "Project" = "Splitrr"
        }
    }

  # module.vpc.aws_nat_gateway.nat_gateway[1] will be created
+   resource "aws_nat_gateway" "nat_gateway" {
+       allocation_id                      = (known after apply)
+       association_id                     = (known after apply)
+       connectivity_type                  = "public"
+       id                                 = (known after apply)
+       network_interface_id               = (known after apply)
+       private_ip                         = (known after apply)
+       public_ip                          = (known after apply)
+       secondary_private_ip_address_count = (known after apply)
+       secondary_private_ip_addresses     = (known after apply)
+       subnet_id                          = (known after apply)
+       tags                               = {
+           "Name" = "splitrr-dev-vpc-nat-gateway"
        }
+       tags_all                           = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "splitrr-dev-vpc-nat-gateway"
+           "Project" = "Splitrr"
        }
    }

  # module.vpc.aws_route.private_nat_route[0] will be created
+   resource "aws_route" "private_nat_route" {
+       destination_cidr_block = "0.0.0.0/0"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       nat_gateway_id         = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)
    }

  # module.vpc.aws_route.private_nat_route[1] will be created
+   resource "aws_route" "private_nat_route" {
+       destination_cidr_block = "0.0.0.0/0"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       nat_gateway_id         = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)
    }

  # module.vpc.aws_route.public_igw_route will be created
+   resource "aws_route" "public_igw_route" {
+       destination_cidr_block = "0.0.0.0/0"
+       gateway_id             = (known after apply)
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)
    }

  # module.vpc.aws_route_table.private_route_table[0] will be created
+   resource "aws_route_table" "private_route_table" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Name" = "splitrr-dev-vpc-private-route-table"
        }
+       tags_all         = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "splitrr-dev-vpc-private-route-table"
+           "Project" = "Splitrr"
        }
+       vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private_route_table[1] will be created
+   resource "aws_route_table" "private_route_table" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Name" = "splitrr-dev-vpc-private-route-table"
        }
+       tags_all         = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "splitrr-dev-vpc-private-route-table"
+           "Project" = "Splitrr"
        }
+       vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public_route_table will be created
+   resource "aws_route_table" "public_route_table" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Name" = "splitrr-dev-vpc-public-route-table"
        }
+       tags_all         = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "splitrr-dev-vpc-public-route-table"
+           "Project" = "Splitrr"
        }
+       vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private_route_table_association[0] will be created
+   resource "aws_route_table_association" "private_route_table_association" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private_route_table_association[1] will be created
+   resource "aws_route_table_association" "private_route_table_association" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public_route_table_association[0] will be created
+   resource "aws_route_table_association" "public_route_table_association" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public_route_table_association[1] will be created
+   resource "aws_route_table_association" "public_route_table_association" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private_subnet[0] will be created
+   resource "aws_subnet" "private_subnet" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.140.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name" = "splitrr-dev-vpc-private-subnet-1"
        }
+       tags_all                                       = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "splitrr-dev-vpc-private-subnet-1"
+           "Project" = "Splitrr"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private_subnet[1] will be created
+   resource "aws_subnet" "private_subnet" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.141.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name" = "splitrr-dev-vpc-private-subnet-2"
        }
+       tags_all                                       = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "splitrr-dev-vpc-private-subnet-2"
+           "Project" = "Splitrr"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public_subnet[0] will be created
+   resource "aws_subnet" "public_subnet" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.128.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name" = "splitrr-dev-vpc-public-subnet-1"
        }
+       tags_all                                       = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "splitrr-dev-vpc-public-subnet-1"
+           "Project" = "Splitrr"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public_subnet[1] will be created
+   resource "aws_subnet" "public_subnet" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.129.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name" = "splitrr-dev-vpc-public-subnet-2"
        }
+       tags_all                                       = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "splitrr-dev-vpc-public-subnet-2"
+           "Project" = "Splitrr"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.vpc will be created
+   resource "aws_vpc" "vpc" {
+       arn                                  = (known after apply)
+       cidr_block                           = "10.0.0.0/16"
+       default_network_acl_id               = (known after apply)
+       default_route_table_id               = (known after apply)
+       default_security_group_id            = (known after apply)
+       dhcp_options_id                      = (known after apply)
+       enable_dns_hostnames                 = true
+       enable_dns_support                   = true
+       enable_network_address_usage_metrics = (known after apply)
+       id                                   = (known after apply)
+       instance_tenancy                     = "default"
+       ipv6_association_id                  = (known after apply)
+       ipv6_cidr_block                      = (known after apply)
+       ipv6_cidr_block_network_border_group = (known after apply)
+       main_route_table_id                  = (known after apply)
+       owner_id                             = (known after apply)
+       tags                                 = {
+           "Name" = "splitrr-dev-vpc"
        }
+       tags_all                             = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "splitrr-dev-vpc"
+           "Project" = "Splitrr"
        }
    }

Plan: 46 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   s3_bucket_arn = (known after apply)
```
</details>

:memo: Plan generated in [CICD for Splitrr Infra #3](https://github.com/bibek65/Splitrr-Infrastructure/actions/runs/10654278662)